In [1]:
import pandas as pd

In [2]:
lst=[1,3,5,7,9]
lst

[1, 3, 5, 7, 9]

In [5]:
pd.DataFrame(data=lst,columns=['Values'],dtype='int')

   Values
0       1
1       3
2       5
3       7
4       9

In [6]:
import numpy as np

In [8]:
arr=np.random.randint(0,30,(5,5))
arr

array([[ 5, 13, 20,  6, 16],
       [ 6,  0,  7, 17, 19],
       [17, 28, 25,  7, 29],
       [21, 23, 16,  1,  4],
       [22, 14, 25,  1, 24]])

In [9]:
df=pd.DataFrame(arr,index=['a','b','c','d','e'],columns=['Val #1','Val #2','Val #3','Val #4','Val #5'])
df

   Val #1  Val #2  Val #3  Val #4  Val #5
a       5      13      20       6      16
b       6       0       7      17      19
c      17      28      25       7      29
d      21      23      16       1       4
e      22      14      25       1      24

In [11]:
n=np.random.randint(4,10,size=6)
n

array([6, 6, 7, 8, 5, 5])

In [12]:
m=np.random.randint(0,10,size=6)
o=np.random.randint(0,10,size=6)
p=np.random.randint(0,10,size=6)

In [14]:
dicts={
    'Messi':n,
    'Ronaldo':m,
    'Platini':o,
    'Van Basten':p
}

dicts

{'Messi': array([6, 6, 7, 8, 5, 5]),
 'Ronaldo': array([2, 4, 9, 3, 1, 6]),
 'Platini': array([9, 9, 3, 8, 9, 2]),
 'Van Basten': array([1, 2, 0, 9, 5, 2])}

In [15]:
df=pd.DataFrame(dicts)
df

   Messi  Ronaldo  Platini  Van Basten
0      6        2        9           1
1      6        4        9           2
2      7        9        3           0
3      8        3        8           9
4      5        1        9           5
5      5        6        2           2

In [21]:
df.head(3)

   Messi  Ronaldo  Platini  Van Basten
0      6        2        9           1
1      6        4        9           2
2      7        9        3           0

In [22]:
df.tail(3)

   Messi  Ronaldo  Platini  Van Basten
3      8        3        8           9
4      5        1        9           5
5      5        6        2           2

In [25]:
df.columns

Index(['Messi', 'Ronaldo', 'Platini', 'Van Basten'], dtype='object')

In [26]:
[i for i in df.columns]

['Messi', 'Ronaldo', 'Platini', 'Van Basten']

In [28]:
df.columns=['Neymar','Mbappe','Hazard','Reus']
df

   Neymar  Mbappe  Hazard  Reus
0       6       2       9     1
1       6       4       9     2
2       7       9       3     0
3       8       3       8     9
4       5       1       9     5
5       5       6       2     2

In [29]:
df.values

array([[6, 2, 9, 1],
       [6, 4, 9, 2],
       [7, 9, 3, 0],
       [8, 3, 8, 9],
       [5, 1, 9, 5],
       [5, 6, 2, 2]])

In [30]:
df.shape

(6, 4)

In [31]:
df.size

24

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Neymar  6 non-null      int32
 1   Mbappe  6 non-null      int32
 2   Hazard  6 non-null      int32
 3   Reus    6 non-null      int32
dtypes: int32(4)
memory usage: 228.0 bytes